Repository: AWS2/djangify-web
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca

source: para enviarte un correo con un codigo que utilizaras
ca: per enviar-te un correu amb un codi que utilitzaràs

source: para actualizar tu contraseña
ca: per actualitzar la teva contrasenya

source: ¿Ya tienes cuenta?
ca: Ja tens un compte?

source: Inicia sesión aquí
ca: Inicia sessió aquí

source: ¡Bienvenido!
ca: Benvingut!

source: Regístrate para empezar
ca: Registra't per començar

source: Nombre de usuario:
ca: Nom d'usuari:

source: Correo electrónico:
ca: Correu electrònic:

source: Contraseña:
ca: Contrasenya:

source: Confirmar contraseña:
ca: Confirma la contrasenya:

source: ¿Olvidaste tu contraseña?
ca: Has oblidat la teva contrasenya?

source: Fecha de entrada en vigor: 27 de mayo de 2025
ca: Data d'entrada en vigor: 27 de maig de 2025

source: 1. Objetivo
ca: 1. Objectiu

source: Estos Términos de Uso regulan el acceso y uso de la plataforma Djangify (djangify.ieti.site), que ofrece un espacio de usuario con contenido exclusivo y descarga de código abierto para la generación de archivos models.py y admin.py en proyectos Django.
ca: Aquests Termes d'Ús regulen l'accés i ús de la plataforma Djangify (djangify.ieti.site), que ofereix un espai d'usuari amb contingut exclusiu i descàrrega de codi obert per a la generació d'arxius models.py i admin.py en projectes Django.

source: 2. Acceso y registro
ca: 2. Accés i registre

source: El acceso al contenido exclusivo requiere el registro previo de una cuenta de usuario.
ca: L'accés al contingut exclusiu requereix el registre previ d'un compte d'usuari.

source: Para registrarse, el usuario debe proporcionar un correo electrónico válido y crear una contraseña.
ca: Per registrar-se, l'usuari ha de proporcionar un correu electrònic vàlid i crear una contrasenya.

source: El usuario es responsable de mantener la confidencialidad de sus credenciales y notificar cualquier uso no autorizado.
ca: L'usuari és responsable de mantenir la confidencialitat de les seves credencials i notificar qualsevol ús no autoritzat.

source: 3. Suscripciones
ca: 3. Subscripcions

source: Al registrarse, el usuario puede optar por distintos planes de suscripción que dan acceso a funcionalidades avanzadas y contenido exclusivo. Las condiciones sobre precios, pagos y renovaciones aparecen detalladas en el panel de suscripciones.
ca: En registrar-se, l'usuari pot optar per diferents plans de subscripció que donen accés a funcionalitats avançades i contingut exclusiu. Les condicions sobre preus, pagaments i renovacions apareixen detallades al panell de subscripcions.

source: 4. Contenido exclusivo y código abierto
ca: 4. Contingut exclusiu i codi obert

source: El contenido exclusivo (tutoriales, guías y recursos avanzados) está disponible únicamente para usuarios suscritos. Sin embargo, el código fuente de la plataforma Djangify es completamente de código abierto y puede descargarse libremente desde nuestro repositorio en GitHub bajo la licencia MIT.
ca: El contingut exclusiu (tutorials, guies i recursos avançats) està disponible únicament per a usuaris subscrits. No obstant això, el codi font de la plataforma Djangify és completament de codi obert i pot descarregar-se lliurement des del nostre repositori a GitHub sota la llicència MIT.

source: 5. Uso aceptable
ca: 5. Ús acceptable

source: El usuario se compromete a utilizar la plataforma de forma lícita y adecuada, absteniéndose de:
ca: L'usuari es compromet a utilitzar la plataforma de forma lícita i adequada, abstenint-se de:

source: Subir o compartir contenido ilegal, difamatorio, ofensivo o que infrinja derechos de terceros.
ca: Pujar o compartir contingut il·legal, difamatori, ofensiu o que infringeixi drets de tercers.

source: Realizar spam, phishing, o cualquier actividad de carácter fraudulento o publicitario no autorizada.
ca: Realitzar spam, phishing, o qualsevol activitat de caràcter fraudulent o publicitari no autoritzada.

source: Suplantar la identidad de otros usuarios o distribuir malware.
ca: Suplantar la identitat d'altres usuaris o distribuir malware.

source: 6. Propiedad intelectual
ca: 6. Propietat intel·lectual

source: Todos los derechos sobre la plataforma y el contenido exclusivo (textos, diseños, imágenes, código, etc.) son titularidad de Djangify, salvo aquellas partes expresamente indicadas como código abierto bajo licencias compatibles.
ca: Tots els drets sobre la plataforma i el contingut exclusiu (textos, dissenys, imatges, codi, etc.) són titularitat de Djangify, excepte aquelles parts expressament indicades com a codi obert sota llicències compatibles.

source: 7. Limitación de responsabilidad
ca: 7. Limitació de responsabilitat

source: Djangify no será responsable de los daños o perjuicios que puedan derivarse del uso de la plataforma, errores en el código proporcionado o interrupciones del servicio, salvo aquellos que por ley no puedan ser excluidos.
ca: Djangify no serà responsable dels danys o perjudicis que puguin derivar-se de l'ús de la plataforma, errors en el codi proporcionat o interrupcions del servei, excepte aquells que per llei no puguin ser exclosos.

source: 8. Modificaciones de los Términos
ca: 8. Modificacions dels Termes

source: Podremos actualizar estos Términos de Uso en cualquier momento. Publicaremos la versión vigente con su fecha de entrada en vigor. Es responsabilidad del usuario revisarlos periódicamente.
ca: Podrem actualitzar aquests Termes d'Ús en qualsevol moment. Publicarem la versió vigent amb la seva data d'entrada en vigor. És responsabilitat de l'usuari revisar-los periòdicament.

source: 9. Legislación aplicable y jurisdicción
ca: 9. Legislació aplicable i jurisdicció

source: Estos Términos se rigen por la legislación española. Para la resolución de cualquier controversia, las partes se someten a los Juzgados y Tribunales del domicilio del usuario.
ca: Aquests Termes es regeixen per la legislació espanyola. Per a la resolució de qualsevol controvèrsia, les parts se sotmeten als Jutjats i Tribunals del domicili de l'usuari.

source: 10. Contacto
ca: 10. Contacte

source: Para cualquier duda o reclamación relativa a estos Términos, puede contactarnos en:
ca: Per a qualsevol dubte o reclamació relativa a aquests Termes, podeu contactar-nos a:
