Repository: AWS2/djangify-web
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ca

source: Política de Cookies
ca: Política de galetes

source: ¿Qué son las cookies?
ca: Què són les galetes?

source: Las cookies son pequeños archivos de texto que los sitios web colocan en su navegador para mejorar la experiencia del usuario. Entre otras funciones, permiten que un sitio recuerde sus acciones y preferencias (como inicio de sesión, idioma, tamaño de fuente y otras configuraciones) durante un período de tiempo, para que no tenga que volver a configurarlas cada vez que regrese al sitio o navegue entre sus páginas.
ca: Les galetes són petits fitxers de text que els llocs web col·loquen al navegador per millorar l'experiència de l'usuari. Entre altres funcions, permeten que un lloc recordi les seves accions i preferències (com l'inici de sessió, l'idioma, la mida de lletra i altres configuracions) durant un període de temps, de manera que no calgui tornar a configurar-les cada vegada que es torni al lloc o es navegui entre les seves pàgines.

source: ¿Qué cookies utiliza djangify.ieti.site?
ca: Quines galetes utilitza djangify.ieti.site?

source: 1. Cookies técnicas o necesarias
ca: 1. Galetes tècniques o necessàries

source: Estas cookies son imprescindibles para el correcto funcionamiento del sitio web y no pueden ser desactivadas. Se utilizan, por ejemplo, para recordar su consentimiento de cookies, gestionar la sesión del usuario o proteger el sitio frente a ataques.
ca: Aquestes galetes són imprescindibles per al correcte funcionament del lloc web i no poden ser desactivades. S'utilitzen, per exemple, per recordar el seu consentiment sobre les galetes, gestionar la sessió de l'usuari o protegir el lloc contra atacs.

source: 2. Cookies de análisis (Google Analytics)
ca: 2. Galetes d'anàlisi (Google Analytics)

source: Este sitio web utiliza <strong>Google Analytics</strong> para obtener estadísticas anónimas sobre la navegación de los usuarios. Con esta información podemos entender cómo interactúan los visitantes con el sitio y mejorar la experiencia de usuario.
ca: Aquest lloc web utilitza <strong>Google Analytics</strong> per obtenir estadístiques anònimes sobre la navegació dels usuaris. Amb aquesta informació, podem entendre com interactuen els visitants amb el lloc i millorar-ne l'experiència.

source: Google recopila datos como la dirección IP (anónimamente), páginas visitadas, duración de la sesión, navegador utilizado, entre otros.
ca: Google recopila dades com l'adreça IP (de forma anònima), les pàgines visitades, la durada de la sessió, el navegador utilitzat, entre d'altres.

source: Para más información, puedes consultar la política de privacidad de Google:
ca: Per a més informació, pots consultar la política de privacitat de Google:

source: Si deseas desactivar Google Analytics, puedes instalar este complemento en tu navegador:
ca: Si vols desactivar Google Analytics, pots instal·lar aquest complement al teu navegador:

source: 3. Cookies de personalización
ca: 3. Galetes de personalització

source: Estas cookies permiten al sitio recordar elecciones que usted ha hecho (como su idioma preferido) y proporcionar características mejoradas y más personales. La información recopilada por estas cookies puede ser anonimizada y no puede rastrear su actividad en otros sitios web.
ca: Aquestes galetes permeten al lloc recordar les eleccions que has fet (com el teu idioma preferit) i oferir característiques millorades i més personalitzades. La informació recollida per aquestes galetes pot ser anonimitzada i no pot rastrejar la teva activitat en altres llocs web.

source: 4. Cookies de redes sociales (GitHub)
ca: 4. Galetes de xarxes socials (GitHub)

source: En Djangify proporcionamos enlaces a nuestra cuenta oficial de <strong>GitHub</strong>. Aunque no utilizamos integraciones embebidas que instalen cookies directamente, GitHub puede recopilar información sobre su interacción si accede a través de nuestros enlaces. Recomendamos consultar su política de privacidad para más información:
ca: A Djangify proporcionem enllaços al nostre compte oficial de <strong>GitHub</strong>. Tot i que no utilitzem integracions incrustades que instal·lin galetes directament, GitHub pot recopilar informació sobre la teva interacció si accedeixes a través dels nostres enllaços. Et recomanem consultar la seva política de privacitat per a més informació:

source: ¿Durante cuánto tiempo se almacenan las cookies?
ca: Durant quant de temps s'emmagatzemen les galetes?

source: La duración del almacenamiento de cookies depende del tipo específico. Algunas se eliminan automáticamente al cerrar el navegador (cookies de sesión), mientras que otras pueden permanecer durante un período más largo (cookies persistentes). No utilizamos cookies con una duración mayor a la estrictamente necesaria.
ca: La durada de l'emmagatzematge de les galetes depèn del tipus específic. Algunes s'eliminen automàticament en tancar el navegador (galetes de sessió), mentre que altres poden romandre durant un període més llarg (galetes persistents). No utilitzem galetes amb una durada superior a la estrictament necessària.

source: ¿Cómo puede gestionar o desactivar las cookies?
ca: Com pots gestionar o desactivar les galetes?

source: Puede configurar su navegador para bloquear o eliminar cookies. Sin embargo, esto puede afectar su experiencia en el sitio web, ya que algunas funciones podrían dejar de estar disponibles.
ca: Pots configurar el teu navegador per bloquejar o eliminar galetes. Tot i això, això pot afectar la teva experiència al lloc web, ja que algunes funcionalitats podrien deixar d'estar disponibles.

source: Aquí tienes enlaces a instrucciones para los navegadores más comunes:
ca: Aquí tens enllaços a les instruccions per als navegadors més comuns:

source: Consentimiento
ca: Consentiment

source: Al acceder por primera vez a nuestro sitio web <strong>djangify.ieti.site</strong>, se le mostrará un aviso emergente sobre el uso de cookies. En dicho aviso, usted podrá:
ca: En accedir per primera vegada al nostre lloc web <strong>djangify.ieti.site</strong>, se't mostrarà un avís emergent sobre l'ús de galetes. En aquest avís podràs:

source: Aceptar
ca: Acceptar

source: todas las cookies.
ca: totes les galetes.

source: Rechazar
ca: Rebutjar

source: todas las cookies no esenciales.
ca: totes les galetes no essencials.

source: Este sistema de consentimiento garantiza que ninguna cookie que no sea estrictamente necesaria se instalará en su navegador sin su autorización previa, en cumplimiento del Reglamento (UE) 2016/679 (RGPD) y la Ley 34/2002 (LSSI-CE).
ca: Aquest sistema de consentiment garanteix que cap galeta que no sigui estrictament necessària s'instal·larà al teu navegador sense la teva autorització prèvia, en compliment del Reglament (UE) 2016/679 (RGPD) i la Llei 34/2002 (LSSI-CE).

source: Usted puede modificar o retirar su consentimiento en cualquier momento accediendo al panel de configuración disponible en el pie de página o a través de la configuración de su navegador.
ca: Pots modificar o retirar el teu consentiment en qualsevol moment accedint al panell de configuració disponible al peu de pàgina o a través de la configuració del teu navegador.

source: Modificaciones a esta Política
ca: Modificacions d'aquesta Política

source: Podemos modificar esta Política de Cookies en cualquier momento para adaptarla a cambios legislativos, técnicos o por decisiones internas. Le recomendamos revisar esta página periódicamente.
ca: Podem modificar aquesta Política de Galetes en qualsevol moment per adaptar-la a canvis legislatius, tècnics o per decisions internes. Et recomanem revisar aquesta pàgina periòdicament.

source: Dashboard
ca: Tauler de control

source: Cambiar contraseña
ca: Canviar contrasenya

source: Nueva contraseña:
ca: Nova contrasenya:

source: Confirmar contraseña:
ca: Confirmar contrasenya:

source: Proyectos
ca: Projectes

source: Crea tu proyecto
ca: Crea el teu projecte

source: Límite alcanzado
ca: Límit assolit

source: Aun no estas validado
ca: Encara no estàs validat

source: Todavía no hay proyectos
ca: Encara no hi ha projectes

source: Home
ca: Inici

source: Este sitio utiliza cookies para mejorar tu experiencia. ¿Aceptas el uso de cookies?
ca: Aquest lloc utilitza galetes per millorar la teva experiència. Acceptes l'ús de galetes?

source: Logo Djangify
ca: Logotip Djangify

source: Subir a produccion nunca fue facil pero ahora es posible con
ca: Pujar a producció mai va ser fàcil però ara és possible amb

source: es una herramienta que simplifica el proceso de creacion y subida a produccion de Djangos a traves de la utilizacion de herramientas IA y contenedores Docker.
ca: és una eina que simplifica el procés de creació i pujada a producció de Django a través de la utilització d'eines d'IA i contenidors Docker.

source: Source Code
ca: Codi font

source: About
ca: Sobre nosaltres

source: Este proyecto representa una apuesta innovadora por la automatización inteligente del despliegue seguro de aplicaciones web basadas en Django. El objetivo es claro: reducir la complejidad técnica que habitualmente conlleva poner en producción una aplicación, y hacerlo posible con la ayuda de la inteligencia artificial. Gracias a esta solución, cualquier equipo técnico puede centrarse en desarrollar valor, mientras la plataforma se encarga de la configuración, la seguridad y la infraestructura.
ca: Aquest projecte representa una aposta innovadora per l'automatització intel·ligent del desplegament segur d'aplicacions web basades en Django. L'objectiu és clar: reduir la complexitat tècnica que habitualment comporta posar en producció una aplicació, i fer-ho possible amb l'ajuda de la intel·ligència artificial. Gràcies a aquesta solució, qualsevol equip tècnic pot centrar-se a desenvolupar valor, mentre la plataforma s'encarrega de la configuració, la seguretat i la infraestructura.

source: La herramienta desarrollada permite generar proyectos Django completos de forma asistida, incluyendo la creación de modelos y paneles de administración, todo ello con soporte de una IA local —basada en marIA— que guía y agiliza cada paso mediante prompts personalizados y generación de código automatizada. Esta IA no solo acelera el desarrollo, sino que también ayuda a mantener buenas prácticas y coherencia en toda la arquitectura del sistema.
ca: L'eina desenvolupada permet generar projectes Django complets de forma assistida, incloent la creació de models i panells d'administració, tot això amb suport d'una IA local —basada en marIA— que guia i agilitza cada pas mitjançant prompts personalitzats i generació de codi automatitzada. Aquesta IA no només accelera el desenvolupament, sinó que també ajuda a mantenir bones pràctiques i coherència en tota l'arquitectura del sistema.

source: Una vez generada la aplicación, el sistema automatiza su contenedorización utilizando Docker, y su posterior despliegue seguro en entornos escalables como Docker Swarm o Kubernetes. Se incorporan herramientas modernas de automatización como Ansible y GitHub Actions, que garantizan un flujo CI/CD robusto y reproducible desde el primer commit hasta la producción.
ca: Un cop generada l'aplicació, el sistema automatitza la seva contenidorització utilitzant Docker, i el seu posterior desplegament segur en entorns escalables com Docker Swarm o Kubernetes. S'incorporen eines modernes d'automatització com Ansible i GitHub Actions, que garanteixen un flux CI/CD robust i reproduïble des del primer commit fins a la producció.

source: La seguridad es un pilar fundamental del proyecto. Se integran herramientas como OWASP ZAP, Nmap y Metasploit para el escaneo de vulnerabilidades y la realización de pruebas de penetración controladas. Además, se configura un sistema de protección basado en cortafuegos (iptables/UFW), cifrado de datos sensibles con GPG y validación automatizada de los requisitos de seguridad antes de cada despliegue.
ca: La seguretat és un pilar fonamental del projecte. S'integren eines com OWASP ZAP, Nmap i Metasploit per a l'escaneig de vulnerabilitats i la realització de proves de penetració controlades. A més, es configura un sistema de protecció basat en tallafocs (iptables/UFW), xifrat de dades sensibles amb GPG i validació automatitzada dels requisits de seguretat abans de cada desplegament.

source: El ecosistema se completa con una solución de monitorización en tiempo real mediante Prometheus y Grafana, lo que permite tener una visión clara del rendimiento y la seguridad del sistema. Desde la creación de dominios personalizados hasta la orquestación de múltiples servicios, todo está diseñado para facilitar la escalabilidad y la gestión profesional de aplicaciones Django en producción.
ca: L'ecosistema es completa amb una solució de monitorització en temps real mitjançant Prometheus i Grafana, la qual cosa permet tenir una visió clara del rendiment i la seguretat del sistema. Des de la creació de dominis personalitzats fins a l'orquestració de múltiples serveis, tot està dissenyat per facilitar l'escalabilitat i la gestió professional d'aplicacions Django en producció.

source: Este proyecto no es solo una herramienta técnica; es una plataforma educativa, colaborativa y potente que demuestra cómo la inteligencia artificial puede integrarse de forma natural en el ciclo de vida de desarrollo de software moderno. Con un enfoque práctico y enfocado a resultados, el sistema busca revolucionar la forma en que se despliegan aplicaciones web, ofreciendo una experiencia segura, automatizada y preparada para los desafíos del mundo real.
ca: Aquest projecte no és només una eina tècnica; és una plataforma educativa, col·laborativa i potent que demostra com la intel·ligència artificial pot integrar-se de forma natural en el cicle de vida de desenvolupament de programari modern. Amb un enfocament pràctic i orientat a resultats, el sistema busca revolucionar la forma en què es despleguen aplicacions web, oferint una experiència segura, automatitzada i preparada per als reptes del món real.

source: Imagen de bienvenida
ca: Imatge de benvinguda

source: Features
ca: Característiques

source: Aviso Legal
ca: Avís legal

source: 1. Titularidad del sitio web
ca: 1. Titularitat del lloc web

source: En cumplimiento de la Ley 34/2002, de 11 de julio, de servicios de la sociedad de la información y de comercio electrónico (LSSI-CE), se informa que este sitio web pertenece a:
ca: En compliment de la Llei 34/2002, d'11 de juliol, de serveis de la societat de la informació i de comerç electrònic (LSSI-CE), s'informa que aquest lloc web pertany a:

source: Nombre de la plataforma: Djangify
ca: Nom de la plataforma: Djangify

source: Titulares: Enric Mieza y Toni Verges
ca: Titulars: Enric Mieza i Toni Verges

source: Correo de contacto: contacto@djangify.ieti.site
ca: Correu de contacte: contacto@djangify.ieti.site

source: Dominio web: https://djangify.ieti.site/
ca: Domini web: https://djangify.ieti.site/

source: 2. Objeto
ca: 2. Objecte

source: El presente Aviso Legal regula el uso del sitio web djangify.ieti.site, cuyo objetivo es ofrecer herramientas, contenido formativo y recursos para el desarrollo de proyectos con Django.
ca: El present Avís Legal regula l'ús del lloc web djangify.ieti.site, l'objectiu del qual és oferir eines, contingut formatiu i recursos per al desenvolupament de projectes amb Django.

source: 3. Condiciones de uso
ca: 3. Condicions d'ús

source: El acceso y uso del sitio web implica la aceptación de las presentes condiciones, así como de los Términos de Uso y, en su caso, de la Política de Privacidad y de Cookies. El usuario se compromete a hacer un uso adecuado del sitio y a no llevar a cabo actividades ilícitas, fraudulentas o que infrinjan derechos de terceros.
ca: L'accés i ús del lloc web implica l'acceptació d'aquestes condicions, així com dels Termes d'Ús i, si escau, de la Política de Privacitat i de Galetes. L'usuari es compromet a fer un ús adequat del lloc i a no dur a terme activitats il·lícites, fraudulentes o que infringeixin drets de tercers.

source: 4. Propiedad intelectual
ca: 4. Propietat intel·lectual

source: Todos los contenidos del sitio (textos, imágenes, código, diseño, etc.) son propiedad de sus titulares, salvo aquellos publicados bajo licencias de código abierto debidamente indicadas. Queda prohibida su reproducción, distribución o uso no autorizado.
ca: Tots els continguts del lloc (textos, imatges, codi, disseny, etc.) són propietat dels seus titulars, excepte aquells publicats sota llicències de codi obert degudament indicades. Queda prohibida la seva reproducció, distribució o ús no autoritzat.

source: 5. Responsabilidad
ca: 5. Responsabilitat

source: Djangify no se hace responsable de posibles errores en el contenido, interrupciones del servicio o daños derivados del uso del sitio, salvo disposición legal en contrario.
ca: Djangify no es fa responsable de possibles errors en el contingut, interrupcions del servei o danys derivats de l'ús del lloc, excepte disposició legal en contra.

source: 6. Enlaces externos
ca: 6. Enllaços externs

source: En el sitio pueden incluirse enlaces a páginas externas. Djangify no se responsabiliza del contenido ni del funcionamiento de dichas páginas.
ca: Al lloc poden incloure-s'hi enllaços a pàgines externes. Djangify no es responsabilitza del contingut ni del funcionament d'aquestes pàgines.

source: 7. Legislación aplicable
ca: 7. Legislació aplicable

source: Este aviso se rige por la legislación española. Para cualquier controversia, las partes se someterán a los juzgados y tribunales del domicilio del usuario.
ca: Aquest avís es regeix per la legislació espanyola. Per a qualsevol controvèrsia, les parts se sotmetran als jutjats i tribunals del domicili de l'usuari.

source: Iniciar sesión
ca: Iniciar sessió

source: ¿Tienes cuenta?
ca: Tens un compte?

source: ¡Inicia sesión!
ca: Inicia sessió!

source: ¿No tienes cuenta?
ca: No tens un compte?

source: Crea una aquí
ca: Crea'n un aquí

source: ¿Olvidaste tu contraseña?
ca: Has oblidat la teva contrasenya?

source: Recuperar contraseña
ca: Recuperar contrasenya

source: Restablecer contraseña
ca: Restablir contrasenya

source: Guardar contraseña
ca: Desar contrasenya

source: Nuevo Proyecto
ca: Nou Projecte

source: Pon tu título aquí
ca: Posa el teu títol aquí

source: Hola 👋, ¿en qué puedo ayudarte con tu proyecto?
ca: Hola 👋, en què et puc ajudar amb el teu projecte?

source: Escribe tu mensaje aquí...
ca: Escriu el teu missatge aquí...

source: Volver
ca: Tornar

source: Guardar proyecto
ca: Desar projecte

source: Politica Cookies
ca: Política de galetes

source: Politica de Privacidad
ca: Política de privacitat

source: Términos y Condiciones de Uso
ca: Termes i condicions d'ús

source: Fecha de entrada en vigor: 18 de mayo de 2025
ca: Data d'entrada en vigor: 18 de maig de 2025

source: 1. Responsable del tratamiento
ca: 1. Responsable del tractament

source: Los responsables del tratamiento de sus datos personales son:
ca: Els responsables del tractament de les vostres dades personals són:

source: Enric Mieza y Toni Verges
ca: Enric Mieza i Toni Verges

source: 2. Datos que recopilamos
ca: 2. Dades que recopilem

source: En Djangify recogemos los siguientes datos personales:
ca: A Djangify recollim les següents dades personals:

source: Correo electrónico, cuando el usuario se registra o inicia sesión.
ca: Correu electrònic, quan l'usuari es registra o inicia sessió.

source: Datos de navegación mediante cookies analíticas (por ejemplo, páginas visitadas, tiempo de permanencia, navegador utilizado, etc.).
ca: Dades de navegació mitjançant cookies analítiques (per exemple, pàgines visitades, temps de permanència, navegador utilitzat, etc.).

source: 3. Finalidad del tratamiento
ca: 3. Finalitat del tractament

source: Tratamos sus datos con las siguientes finalidades:
ca: Tractem les vostres dades amb les següents finalitats:

source: Gestionar el acceso y uso de cuentas de usuario registradas.
ca: Gestionar l'accés i ús de comptes d'usuari registrades.

source: Responder a consultas o incidencias si nos contacta.
ca: Respondre a consultes o incidències si ens contacteu.

source: Obtener estadísticas de uso del sitio mediante Google Analytics, de forma anónima y agregada.
ca: Obtenir estadístiques d'ús del lloc mitjançant Google Analytics, de forma anònima i agregada.

source: 4. Base legal para el tratamiento
ca: 4. Base legal per al tractament

source: La base legal para el tratamiento de sus datos es:
ca: La base legal per al tractament de les vostres dades és:

source: Su consentimiento, otorgado al registrarse o al aceptar el uso de cookies.
ca: El vostre consentiment, atorgat en registrar-vos o en acceptar l'ús de cookies.

source: La ejecución de un contrato, en el caso del uso de la funcionalidad de login.
ca: L'execució d'un contracte, en el cas de l'ús de la funcionalitat de login.

source: Interés legítimo, en el caso de cookies necesarias para el funcionamiento del sitio.
ca: Interès legítim, en el cas de cookies necessàries per al funcionament del lloc.

source: 5. Destinatarios de los datos
ca: 5. Destinataris de les dades

source: No se cederán datos a terceros, salvo obligación legal.
ca: No es cediran dades a tercers, excepte obligació legal.

source: El único tercero con acceso a datos es:
ca: L'únic tercer amb accés a dades és:

source: Google LLC, a través del servicio Google Analytics (ver política de privacidad:
ca: Google LLC, a través del servei Google Analytics (veure política de privacitat:

source: Google puede transferir datos a EE.UU. bajo cláusulas contractuales tipo aprobadas por la Comisión Europea.
ca: Google pot transferir dades als EUA sota clàusules contractuals tipus aprovades per la Comissió Europea.

source: 6. Conservación de los datos
ca: 6. Conservació de les dades

source: Conservamos sus datos personales mientras tenga una cuenta activa o mientras sea necesario para cumplir con la finalidad para la que fueron recopilados. Posteriormente, serán eliminados o anonimizados.
ca: Conservem les vostres dades personals mentre tingueu un compte actiu o mentre sigui necessari per complir amb la finalitat per a la qual van ser recopilades. Posteriorment, seran eliminades o anonimitzades.

source: Usted tiene derecho a:
ca: Teniu dret a:

source: Acceder a sus datos personales.
ca: Accedir a les vostres dades personals.

source: Solicitar su rectificación o supresión.
ca: Sol·licitar la seva rectificació o supressió.

source: Limitar u oponerse a su tratamiento.
ca: Limitar o oposar-se al seu tractament.

source: Retirar su consentimiento en cualquier momento.
ca: Retirar el vostre consentiment en qualsevol moment.

source: Presentar una reclamación ante la Agencia Española de Protección de Datos (www.aepd.es).
ca: Presentar una reclamació davant l'Agència Espanyola de Protecció de Dades (www.aepd.es).

source: Puede ejercer sus derechos escribiéndonos a:
ca: Podeu exercir els vostres drets escrivint-nos a:

source: 8. Menores de edad
ca: 8. Menors d'edat

source: Este sitio web no está dirigido a menores de 14 años. No recopilamos conscientemente información personal de menores.
ca: Aquest lloc web no està dirigit a menors de 14 anys. No recopilem conscientment informació personal de menors.

source: 9. Cambios en esta política
ca: 9. Canvis en aquesta política

source: Nos reservamos el derecho de modificar esta política para adaptarla a futuras novedades legales o técnicas. Le recomendamos revisarla periódicamente.
ca: Ens reservem el dret de modificar aquesta política per adaptar-la a futures novetats legals o tècniques. Us recomanem revisar-la periòdicament.

source: Recuperar contraseña:
ca: Recuperar contrasenya:

source: Para recuperar tu contraseña necesitaremos tu correo
ca: Per recuperar la teva contrasenya necessitarem el teu correu
